Script started on Fri 22 Mar 2019 06:19:30 PM EDT
yangme16@dh2020pc18:~/209_repo/t10$ gdb randclient
GNU gdb (Ubuntu 7.11.1-0ubuntu1~16.5) 7.11.1
Copyright (C) 2016 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from randclient...done.
(gdb) break main
Breakpoint 1 at 0x401135: file randclient.c, line 24.
(gdb) run 127.0.0.1
Starting program: /student/yangme16/209_repo/t10/randclient 127.0.0.1
[Thread debugging using libthread_db enabled]
Using host libthread_db library "/lib/x86_64-linux-gnu/libthread_db.so.1".

Breakpoint 1, main (argc=2, argv=0x7fffffffea88) at randclient.c:24
24	    if (argc != 2) {
(gdb) next
29	    int soc = connect_to_server(PORT, argv[1]);
(gdb) n
connect: Connection refused
[Inferior 1 (process 20115) exited with code 01]
(gdb) nextrun 127.0.0.1
Starting program: /student/yangme16/209_repo/t10/randclient 127.0.0.1
[Thread debugging using libthread_db enabled]
Using host libthread_db library "/lib/x86_64-linux-gnu/libthread_db.so.1".

Breakpoint 1, main (argc=2, argv=0x7fffffffea88) at randclient.c:24
24	    if (argc != 2) {
(gdb) n
29	    int soc = connect_to_server(PORT, argv[1]);
(gdb) n
31	    write_random_pieces(soc, MESSAGE, TIMES);
(gdb) n
33	    close(soc);
(gdb) n
34	    return 0;
(gdb) quit
A debugging session is active.

	Inferior 1 [process 20135] will be killed.

Quit anyway? (y or n) y
yangme16@dh2020pc18:~/209_repo/t10$ exit
exit

Script done on Fri 22 Mar 2019 06:23:08 PM EDT
